trade_exp/src/Catalogs/ВидыИспользованияРабочегоВремени/ВидыИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f1ae8166-42dc-403e-ade4-33ff8c5ffa11">
  <name>ВидыИспользованияРабочегоВремени</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="acc6c5fc-ea40-49c7-9b95-fe321dacfb63">
    <name>БуквенныйКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="904b8764-68fa-4dd2-8318-95808836ba08">
    <name>ЦифровойКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="866fd3b2-5c64-4822-bc8a-f5902da85af3">
    <name>ПолноеНаименование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="093c6e04-2aaa-4ec1-bf43-6fd223d6057c">
    <name>РабочееВремя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c290f0b-3296-4cb7-b939-8c081eb041f1">
    <name>Целосменное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="776c8fac-946b-4b5e-8e15-791244877470">
    <name>Сотрировка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/ВидыИспользованияРабочегоВремени/Forms/ФормаСписка/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.РежимВыбора Тогда
		
		Элементы.Список.РежимВыбора = Истина;
		
		РежимВыбораИнформацииОВидеВремени = Параметры.РежимВыбораИнформацииОВидеВремени;
		
		Если РежимВыбораИнформацииОВидеВремени Тогда
			РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если РежимВыбораИнформацииОВидеВремени Тогда
		СтандартнаяОбработка = Ложь;
	
		ДанныеТекущейСтроки = Элементы.Список.ТекущиеДанные;
		
		ДанныеВыбора = Новый Структура("ВидВремени, БуквенноеОбозначение, Наименование, Целосменное"); 
		
		ДанныеВыбора.ВидВремени = ВыбраннаяСтрока;
		
		Если ДанныеТекущейСтроки <> Неопределено Тогда
			ДанныеВыбора.БуквенноеОбозначение = ДанныеТекущейСтроки.БуквенныйКод;
			ДанныеВыбора.Наименование = ДанныеТекущейСтроки.Наименование;
			ДанныеВыбора.Целосменное = ДанныеТекущейСтроки.Целосменное;
		КонецЕсли;
		
	 	ОповеститьОВыборе(ДанныеВыбора);	
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьЗначениямиПоУмолчаниюНаСервере()
Справочники.ВидыИспользованияРабочегоВремени.СоздатьВидыИспользованияРабочегоВремениПоНастройкам();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьЗначениямиПоУмолчанию(Команда)
	ЗаполнитьЗначениямиПоУмолчаниюНаСервере();
КонецПроцедуры
